evidence/l1/20260920-cs207-site-mutations-ea9d10a0/orc-801-demand-is-on-vehicle.diff
diff --git a/src/ControlServer.Host/Transport/OnboardRecoveryCoordinator.cs b/src/ControlServer.Host/Transport/OnboardRecoveryCoordinator.cs
index 6a647d6d..e64bcb0a 100644
--- a/src/ControlServer.Host/Transport/OnboardRecoveryCoordinator.cs
+++ b/src/ControlServer.Host/Transport/OnboardRecoveryCoordinator.cs
@@ -798,7 +798,7 @@ public sealed class OnboardRecoveryCoordinator(
     /// on no vehicle.
     /// </summary>
     private Task<bool> DemandIsOnVehicleAsync(string demandId, string agvId, CancellationToken cancellationToken) =>
-        DemandJourneyLookup.JourneyOf(dbContext, demandId).AsNoTracking()
+        DemandJourneyLookup.JourneyOf(dbContext, "cs207-site-mutant").AsNoTracking()
             .AnyAsync(row => row.AgvId == agvId, cancellationToken);
 
     private async Task<string> AuthorizeLoadCompensationAsync(
