evidence/l1/20260920-cs207-site-mutations-ea9d10a0/omp-981-receipt-station-deadline.diff
diff --git a/src/ControlServer.Host/Transport/OnboardMessageProcessor.cs b/src/ControlServer.Host/Transport/OnboardMessageProcessor.cs
index 96f37692..3b72d34f 100644
--- a/src/ControlServer.Host/Transport/OnboardMessageProcessor.cs
+++ b/src/ControlServer.Host/Transport/OnboardMessageProcessor.cs
@@ -978,7 +978,7 @@ public sealed partial class OnboardMessageProcessor(
     /// </summary>
     private async Task<OperationResultReceipt> ReceiptAsync(string demandId, CancellationToken cancellationToken)
     {
-        JourneyRuntimeRow? journey = await DemandJourneyLookup.JourneyOf(dbContext, demandId).AsNoTracking()
+        JourneyRuntimeRow? journey = await DemandJourneyLookup.JourneyOf(dbContext, "cs207-site-mutant").AsNoTracking()
             .SingleOrDefaultAsync(cancellationToken).ConfigureAwait(false);
         return new OperationResultReceipt(
             timeProvider.GetUtcNow(),
